<a href="https://colab.research.google.com/github/mohd-faizy/CAREER-TRACK-Machine-Learning-Scientist-with-Python/blob/main/02_Dealing_with_Messy_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

--- 
<strong> 
    <h1 align='center'>Conforming to Statistical Assumptions</h1> 
</strong>

---
> In this chapter, you will focus on analyzing the underlying distribution of your data and whether it will impact your machine learning pipeline. You will learn how to deal with skewed data and situations where outliers may be negatively impacting your analysis.

In [1]:
!git clone https://github.com/mohd-faizy/CAREER-TRACK-Machine-Learning-Scientist-with-Python.git

Cloning into 'CAREER-TRACK-Machine-Learning-Scientist-with-Python'...
remote: Enumerating objects: 275, done.
remote: Counting objects: 100% (275/275), done.
remote: Compressing objects: 100% (248/248), done.
remote: Total 604 (delta 53), reused 240 (delta 25), pack-reused 329
Receiving objects: 100% (604/604), 198.75 MiB | 32.55 MiB/s, done.
Resolving deltas: 100% (179/179), done.
Checking out files: 100% (296/296), done.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

plt.style.use('fivethirtyeight')
#plt.style.use('ggplot')
#sns.set_theme()

%matplotlib inline

In [3]:
os.chdir('/content/CAREER-TRACK-Machine-Learning-Scientist-with-Python/09_Feature_Engineering_for_Machine_Learning_in_Python/_dataset')
cwd = os.getcwd()
print('Curent working directory is ', cwd)

Curent working directory is  /content/CAREER-TRACK-Machine-Learning-Scientist-with-Python/09_Feature_Engineering_for_Machine_Learning_in_Python/_dataset

In [4]:
ls

Combined_DS_v10.csv  inaugural_speeches.csv

## Why do missing values exist?
- *How gaps in data occur*
    - Data not being collected properly
    - Collection and management errors
    - Data intentionally being omitted
    - Could be created due to transformations of the data
    
- *Why we care?*
    - Some models cannot work with missing data (Nulls/NaN)
    - Missing data may be a sign a wider data issue
    - Missing data can be a useful feature

### *How sparse is my data?*

Most data sets contain missing values, often represented as `NaN` (Not a Number). If you are working with Pandas you can easily check how many missing values exist in each column.

Let's find out how many of the developers taking the survey chose to enter their age (found in the `Age` column of `so_survey_df`) and their gender (`Gender` column of `so_survey_df`).

In [5]:
so_survey_df = pd.read_csv('Combined_DS_v10.csv')
so_survey_df.head()

      SurveyDate  ...   RawSalary
0  2/28/18 20:20  ...         NaN
1  6/28/18 13:26  ...   70,841.00
2    6/6/18 3:37  ...         NaN
3    5/9/18 1:06  ...   21,426.00
4  4/12/18 22:41  ...  £41,671.00

[5 rows x 11 columns]

In [6]:
so_survey_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   SurveyDate                  999 non-null    object
 1   FormalEducation             999 non-null    object
 2   ConvertedSalary             665 non-null    float64
 3   Hobby                       999 non-null    object
 4   Country                     999 non-null    object
 5   StackOverflowJobsRecommend  487 non-null    float64
 6   VersionControl              999 non-null    object
 7   Age                         999 non-null    int64
 8   Years Experience            999 non-null    int64
 9   Gender                      693 non-null    object
 10  RawSalary                   665 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 86.0+ KB

In [7]:
# Subset the DataFrame
sub_df = so_survey_df[['Age', 'Gender']]

# Print the number of non-missing values
print(sub_df.notnull().sum())

Age       999
Gender    693
dtype: int64

### *Finding the missing values*
While having a summary of how much of your data is missing can be useful, often you will need to find the exact locations of these missing values. Using the same subset of the StackOverflow data from the last exercise (`sub_df`), you will show how a value can be flagged as missing.

In [8]:
# Print the top 10 entries of the DataFrame
sub_df.head(10)

   Age  Gender
0   21    Male
1   38    Male
2   45     NaN
3   46    Male
4   39    Male
5   39    Male
6   34    Male
7   24  Female
8   23    Male
9   36     NaN

In [9]:
# Print the locations of the missing values
sub_df.head(10).isnull()

     Age  Gender
0  False   False
1  False   False
2  False    True
3  False   False
4  False   False
5  False   False
6  False   False
7  False   False
8  False   False
9  False    True

In [10]:
# Print the locations of the missing values
sub_df.head(10).notnull()

    Age  Gender
0  True    True
1  True    True
2  True   False
3  True    True
4  True    True
5  True    True
6  True    True
7  True    True
8  True    True
9  True   False

## 1. Dealing with missing values ($I^{st}$)
- Issues with deletion
    - It deletes vaild data points
    - Relies on randomness
    - Reduces information

### *Listwise deletion*

The simplest way to deal with missing values in your dataset when they are occurring entirely at random is to remove those rows, also called **'listwise deletion'**.

Depending on the use case, you will sometimes want to remove all missing values in your data while other times you may want to only remove a particular column if too many values are missing in that column.

In [11]:
# Print the number of rows and columns
print(so_survey_df.shape)

(999, 11)

#### ***Dropping all incomplete rows***

- `how{‘any’, ‘all’}`, __default__ `‘any’`

Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.

- `‘any’` : *If any NA values are present, drop that row or column.*

- `‘all’` : *If all values are NA, drop that row or column.*

- `df.dropna(thresh=2)`: *if we want to Keep only the rows with at least 2 non-NA values.*


- `df.dropna(subset=['Gender', 'RawSalary'])`: *Defining in which columns to look for missing values.*

In [12]:
# Drop all rows with at least one missing values
so_survey_df.dropna(how='any').shape

(264, 11)

In [13]:
# Create a new DataFrame dropping all incomplete rows
no_missing_values_rows = so_survey_df.dropna()

# Print the shape of the new DataFrame
print(no_missing_values_rows.shape)

(264, 11)

#### ***Dropping all columns*** with incomplete rows

In [14]:
# Create a new DataFrame dropping all columns with incomplete rows
no_missing_values_cols = so_survey_df.dropna(axis=1)

# Print the shape fo the new DataFrame
print(no_missing_values_cols.shape)

(999, 7)

#### ***Droping all rows*** where `Gender` is missing

In [15]:
# Drop all rows where Gender is missing
no_gender = so_survey_df.dropna(subset=['Gender'])

# Print the shape of the new DataFrame
print(no_gender.shape)

(693, 11)

> ***As you can see dropping all rows that contain any missing values may greatly reduce the size of your dataset. So you need to think carefully and consider several trade-offs when deleting missing values.***

### *Replacing missing values with constants*

While removing missing data entirely maybe a correct approach in many situations, this may result in a lot of information being omitted from your models.

You may find categorical columns where the missing value is a valid piece of information in itself, such as someone refusing to answer a question in a survey. In these cases, you can fill all missing values with a new category entirely, for example **'No response given'**.

In [16]:
# Print the count of occurrence
print(so_survey_df['Gender'].value_counts())

Male                                                                         632
Female                                                                        53
Transgender                                                                    2
Female;Male                                                                    2
Female;Transgender                                                             1
Female;Male;Transgender;Non-binary. genderqueer. or gender non-conforming      1
Non-binary. genderqueer. or gender non-conforming                              1
Male;Non-binary. genderqueer. or gender non-conforming                         1
Name: Gender, dtype: int64

In [17]:
# Replace missing values
so_survey_df['Gender'].fillna('Not Given', inplace=True)

# Print the count of each value
print(so_survey_df['Gender'].value_counts())
print()
print(so_survey_df['Gender'].head())

Male                                                                         632
Not Given                                                                    306
Female                                                                        53
Transgender                                                                    2
Female;Male                                                                    2
Female;Transgender                                                             1
Female;Male;Transgender;Non-binary. genderqueer. or gender non-conforming      1
Non-binary. genderqueer. or gender non-conforming                              1
Male;Non-binary. genderqueer. or gender non-conforming                         1
Name: Gender, dtype: int64

0         Male
1         Male
2    Not Given
3         Male
4         Male
Name: Gender, dtype: object

__Note__ - *Deleting missing values*

>One of the most common issues with removing all rows with missing values is if you were building a predictive model. If you were to remove all cases that had missing values when training your model, you would quickly run into problems when you received missing values in your test set, where you do not have the option of just not predicting these rows.

## 2. Dealing with missing values ($II^{nd}$)

- Deleting missing values
    - Can't delete rows with missing values in the test set
- What else can you do?

    - ***Categorical columns***: Replace missing values with the most common occurring value or with a string that flags missing values such as **'None'**
    - ***Numerical columns***: Replace missing values with a suitable value


However, for numeric columns, you may want to replace missing values with a more suitable value. So what is a suitable value?

>In cases like this we often turn to the **measures of central tendency**, which are the central or typical value for a distribution. The most commonly used values are the
- ***Mean*** 
- and the ***Median***

One caveat that you must keep in mind when using these methods is that it ***can lead to biased estimates*** of the **variances** and **covariances** of the features.

Similarly, the __standard error__ and __test statistics__ can be _incorrectly_ estimated so if these metrics are needed they should be calculated before the missing values have been filled.

```python
print(df['ConvertedSalary'].mean())
print(df['ConvertedSalary'].median())
```

__Fill the missing values__

```python
df['ConvertedSalary'] = df['ConvertedSalary'].fillna(df['ConvertedSalary'].mean()) 
df['ConvertedSalary'] = df['ConvertedSalary'].astype('int64')
```
Since we filled in the missing values with the `mean`, we may end up with too many _decimal places_. You can get rid of all the _decimal values_ by changing the data type to integer using the `astype()` method like so.

__Rounding values__
```python
df['ConvertedSalary'] = df['ConvertedSalary'].fillna(round(df['ConvertedSalary'].mean()))
```

### *Filling continuous missing values*

In the last lesson, you dealt with different methods of removing data missing values and filling in missing values with a fixed string. These approaches are valid in many cases, particularly when dealing with categorical columns but have limited use when working with continuous values. In these cases, it may be most valid to fill the missing values in the column with a value calculated from the entries present in the column.

In [18]:
# Print the first five rows of StackOverflowJobsRecommend column
so_survey_df['StackOverflowJobsRecommend'].head()

0    NaN
1    7.0
2    8.0
3    NaN
4    8.0
Name: StackOverflowJobsRecommend, dtype: float64

In [19]:
# Fill missing values with the mean
so_survey_df['StackOverflowJobsRecommend'].fillna(so_survey_df['StackOverflowJobsRecommend'].mean(), 
                                                  inplace=True)

# Round the StackOverflowJobsRecommend values
so_survey_df['StackOverflowJobsRecommend'] = round(so_survey_df['StackOverflowJobsRecommend'])

# Print the first five rows of StackOverflowJobsRecommend column
so_survey_df['StackOverflowJobsRecommend'].head()

0    7.0
1    7.0
2    8.0
3    7.0
4    8.0
Name: StackOverflowJobsRecommend, dtype: float64

## Dealing with other data issues

### *Dealing with stray characters ($I^{st}$)*

In this exercise, you will work with the `RawSalary` column of `so_survey_df` which contains the wages of the respondents along with the currency symbols and commas, such as `$42,000`. When importing data from Microsoft Excel, more often that not you will come across data in this form.

In [20]:
# Remove the commas in the column
so_survey_df['RawSalary'] = so_survey_df['RawSalary'].str.replace(',', '')

# Remove the dollar signs in the column
so_survey_df['RawSalary'] = so_survey_df['RawSalary'].str.replace('$', '')
so_survey_df['RawSalary'] = so_survey_df['RawSalary'].str.replace('£', '')

print(so_survey_df['RawSalary'].dtype)

object

In [21]:
so_survey_df['RawSalary'] = so_survey_df['RawSalary'].astype('float')
print(so_survey_df['RawSalary'].dtype)

float64

In [22]:
# Print the column
so_survey_df['RawSalary']

0            NaN
1        70841.0
2            NaN
3        21426.0
4        41671.0
         ...
994          NaN
995      58746.0
996      55000.0
997          NaN
998    1000000.0
Name: RawSalary, Length: 999, dtype: float64

### *Dealing with stray characters ($II^{nd}$)*
In the last exercise, you could tell quickly based off of the `df.head()` call which characters were causing an issue. In many cases this will not be so apparent. There will often be values deep within a column that are preventing you from casting a column as a numeric type so that it can be used in a model or further feature engineering.

One approach to finding these values is to force the column to the data type desired using `pd.to_numeric()`, coercing any values causing issues to NaN, Then filtering the DataFrame by just the rows containing the NaN values.

Try to cast the `RawSalary` column as a float and it will fail as an additional character can now be found in it. Find the character and remove it so the column can be cast as a float.

In [23]:
# Attempt to convert the column to numeric values
numeric_vals = pd.to_numeric(so_survey_df['RawSalary'], errors='coerce')

# find the indexes of missing values
idx = so_survey_df['RawSalary'].isna()

# Print the relevant raws
print(so_survey_df['RawSalary'][idx])

0     NaN
2     NaN
6     NaN
8     NaN
11    NaN
       ..
989   NaN
990   NaN
992   NaN
994   NaN
997   NaN
Name: RawSalary, Length: 334, dtype: float64

### *Method chaining*

When applying multiple operations on the same column (like in the previous exercises), you made the changes in several steps, assigning the results back in each step. However, when applying multiple successive operations on the same column, you can "chain" these operations together for clarity and ease of management. This can be achieved by calling multiple methods sequentially:

```python
# Method chaining
df['column'] = df['column'].method1().method2().method3()

# Same as 
df['column'] = df['column'].method1()
df['column'] = df['column'].method2()
df['column'] = df['column'].method3()
```
In this exercise you will repeat the steps you performed in the last two exercises, but do so using method chaining.

In [24]:
so_survey_df = pd.read_csv('Combined_DS_v10.csv')
# Use method chaining
so_survey_df['RawSalary'] = so_survey_df['RawSalary']\
                            .str.replace(',', '')\
                            .str.replace('$', '')\
                            .str.replace('£', '')\
                            .astype(float)

# Print the RawSalary column
print(so_survey_df['RawSalary'])

0            NaN
1        70841.0
2            NaN
3        21426.0
4        41671.0
         ...
994          NaN
995      58746.0
996      55000.0
997          NaN
998    1000000.0
Name: RawSalary, Length: 999, dtype: float64

## __Connect with Me__ 
--- 
[<img align="left" alt="codeSTACKr | Twitter" width="40px" src="https://cdn.jsdelivr.net/npm/simple-icons@v3/icons/twitter.svg" />][twitter] 
[<img align="left" alt="codeSTACKr | LinkedIn" width="40px" src="https://cdn.jsdelivr.net/npm/simple-icons@v3/icons/linkedin.svg" />][linkedin] 
[<img align="left" alt="codeSTACKr.com" width="40px" src="https://raw.githubusercontent.com/iconic/open-iconic/master/svg/globe.svg" />][StackExchange AI] 
[twitter]: https://twitter.com/F4izy 
--- 
[linkedin]: https://www.linkedin.com/in/mohd-faizy/ 
--- 
[StackExchange AI]: https://mohd-faizy.github.io
--- 
--- 
--- 
---